contiki-os/contiki/cc26xxware/inc/hw_crypto.h
// Field: [5]    RAM_AREA5
//
// Represents an area of 128 bits.
// Select the key store RAM area(s) where the key(s) needs to be written.
//
// Writing to multiple RAM locations is only possible when the selected RAM
// areas are sequential.
// ENUMs:
// NOT_SEL              This RAM area is not selected to be written
// SEL                  This RAM area is selected to be written
//
#define CRYPTO_KEYWRITEAREA_RAM_AREA5                               0x00000020
#define CRYPTO_KEYWRITEAREA_RAM_AREA5_BITN                          5
#define CRYPTO_KEYWRITEAREA_RAM_AREA5_M                             0x00000020
#define CRYPTO_KEYWRITEAREA_RAM_AREA5_S                             5
#define CRYPTO_KEYWRITEAREA_RAM_AREA5_NOT_SEL                       0x00000000
#define CRYPTO_KEYWRITEAREA_RAM_AREA5_SEL                           0x00000020

// Field: [4]    RAM_AREA4
//
// Represents an area of 128 bits.
// Select the key store RAM area(s) where the key(s) needs to be written.
//
// Writing to multiple RAM locations is only possible when the selected RAM
// areas are sequential.
// ENUMs:
// NOT_SEL              This RAM area is not selected to be written
// SEL                  This RAM area is selected to be written
//
#define CRYPTO_KEYWRITEAREA_RAM_AREA4                               0x00000010
#define CRYPTO_KEYWRITEAREA_RAM_AREA4_BITN                          4
#define CRYPTO_KEYWRITEAREA_RAM_AREA4_M                             0x00000010
#define CRYPTO_KEYWRITEAREA_RAM_AREA4_S                             4
#define CRYPTO_KEYWRITEAREA_RAM_AREA4_NOT_SEL                       0x00000000
#define CRYPTO_KEYWRITEAREA_RAM_AREA4_SEL                           0x00000010

// Field: [3]    RAM_AREA3
//
// Represents an area of 128 bits.
// Select the key store RAM area(s) where the key(s) needs to be written.
//
// Writing to multiple RAM locations is only possible when the selected RAM
// areas are sequential.
// ENUMs:
// NOT_SEL              This RAM area is not selected to be written
// SEL                  This RAM area is selected to be written
//
#define CRYPTO_KEYWRITEAREA_RAM_AREA3                               0x00000008
#define CRYPTO_KEYWRITEAREA_RAM_AREA3_BITN                          3
#define CRYPTO_KEYWRITEAREA_RAM_AREA3_M                             0x00000008
#define CRYPTO_KEYWRITEAREA_RAM_AREA3_S                             3
#define CRYPTO_KEYWRITEAREA_RAM_AREA3_NOT_SEL                       0x00000000
#define CRYPTO_KEYWRITEAREA_RAM_AREA3_SEL                           0x00000008

// Field: [2]    RAM_AREA2
//
// Represents an area of 128 bits.
// Select the key store RAM area(s) where the key(s) needs to be written.
//
// Writing to multiple RAM locations is only possible when the selected RAM
// areas are sequential.
// ENUMs:
// NOT_SEL              This RAM area is not selected to be written
// SEL                  This RAM area is selected to be written
//
#define CRYPTO_KEYWRITEAREA_RAM_AREA2                               0x00000004
#define CRYPTO_KEYWRITEAREA_RAM_AREA2_BITN                          2
#define CRYPTO_KEYWRITEAREA_RAM_AREA2_M                             0x00000004
#define CRYPTO_KEYWRITEAREA_RAM_AREA2_S                             2
#define CRYPTO_KEYWRITEAREA_RAM_AREA2_NOT_SEL                       0x00000000
#define CRYPTO_KEYWRITEAREA_RAM_AREA2_SEL                           0x00000004

// Field: [1]    RAM_AREA1
//
// Represents an area of 128 bits.
// Select the key store RAM area(s) where the key(s) needs to be written.
//
// Writing to multiple RAM locations is only possible when the selected RAM
// areas are sequential.
// ENUMs:
// NOT_SEL              This RAM area is not selected to be written
// SEL                  This RAM area is selected to be written
//
#define CRYPTO_KEYWRITEAREA_RAM_AREA1                               0x00000002
#define CRYPTO_KEYWRITEAREA_RAM_AREA1_BITN                          1
#define CRYPTO_KEYWRITEAREA_RAM_AREA1_M                             0x00000002
#define CRYPTO_KEYWRITEAREA_RAM_AREA1_S                             1
#define CRYPTO_KEYWRITEAREA_RAM_AREA1_NOT_SEL                       0x00000000
#define CRYPTO_KEYWRITEAREA_RAM_AREA1_SEL                           0x00000002

// Field: [0]    RAM_AREA0
//
// Represents an area of 128 bits.
// Select the key store RAM area(s) where the key(s) needs to be written.
//
// Writing to multiple RAM locations is only possible when the selected RAM
// areas are sequential.
// ENUMs:
// NOT_SEL              This RAM area is not selected to be written
// SEL                  This RAM area is selected to be written
//
#define CRYPTO_KEYWRITEAREA_RAM_AREA0                               0x00000001
#define CRYPTO_KEYWRITEAREA_RAM_AREA0_BITN                          0
#define CRYPTO_KEYWRITEAREA_RAM_AREA0_M                             0x00000001
#define CRYPTO_KEYWRITEAREA_RAM_AREA0_S                             0
#define CRYPTO_KEYWRITEAREA_RAM_AREA0_NOT_SEL                       0x00000000
#define CRYPTO_KEYWRITEAREA_RAM_AREA0_SEL                           0x00000001

//*****************************************************************************
//
// Register: CRYPTO_O_KEYWRITTENAREA
//
//*****************************************************************************
// Field: [7]    RAM_AREA_WRITTEN7
//
// On read this bit returns the key area written status.
//
// This bit can be reset by writing a 1.
//
// Note: This register will be reset on a soft reset initiated by writing to
// DMASWRESET.RESET. After a soft reset, all keys must be rewritten to the key
// store memory.
// ENUMs:
// NOT_WRITTEN          This RAM area is not written with valid key information
// WRITTEN              This RAM area is written with valid key information
//
#define CRYPTO_KEYWRITTENAREA_RAM_AREA_WRITTEN7                     0x00000080
#define CRYPTO_KEYWRITTENAREA_RAM_AREA_WRITTEN7_BITN                7
#define CRYPTO_KEYWRITTENAREA_RAM_AREA_WRITTEN7_M                   0x00000080
#define CRYPTO_KEYWRITTENAREA_RAM_AREA_WRITTEN7_S                   7
#define CRYPTO_KEYWRITTENAREA_RAM_AREA_WRITTEN7_NOT_WRITTEN         0x00000000
#define CRYPTO_KEYWRITTENAREA_RAM_AREA_WRITTEN7_WRITTEN             0x00000080

